tests/load/concurrent-bookings.yml
# Load Test: Concurrent Bookings

# Tests booking system under load to verify no double-bookings

# Target: No time blocks exceed max capacity

 

config:

  target: "{{ $processEnvironment.LOAD_TEST_URL }}"

  phases:

    - duration: 10

      arrivalRate: 1

      name: "Warm up"

    - duration: 30

      arrivalRate: 5

      name: "Spike load - simulate lottery rush"

  processor: "./test-helpers.js"

  variables:

    testDate: "2025-11-21"

 

scenarios:

  - name: "Add Member to Time Block"

    flow:

      - function: "setAuthHeaders"

      - function: "generateBookingData"

      - post:

          url: "/api/teesheet/add-member"

          json:

            timeBlockId: "{{ timeBlockId }}"

            memberId: "{{ memberId }}"

          headers:

            Cookie: "{{ adminAuthCookie }}"

            Content-Type: "application/json"

          capture:

            - json: "$.success"

              as: "bookingSuccess"

          expect:

            - statusCode: 200

      - think: 1

 

      - log: "Booking result: {{ bookingSuccess }}"